STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval.c
/**
  ******************************************************************************
  * @file    stm32mp257f_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons
  *          COM ports
  *          available on STM32MP257F-EV1 board(MB170/4,5,6) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp257f_eval.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257F_EV1
  * @{
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL_Private_TypesDefinitions  Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL_Private_FunctionPrototypes  Private Function Prototypes
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_USER1_EXTI_Callback(void);
static void BUTTON_USER2_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
static int32_t BSP_LED_MspInit(Led_TypeDef Led);
static int32_t BSP_LED_MspDeInit(Led_TypeDef Led);
static int32_t BSP_PB_MspInit(Button_TypeDef Button);
static int32_t BSP_PB_MspDeInit(Button_TypeDef Button);
#endif /* CORE_CA35 || CORE_CM33 */
#if (USE_BSP_COM_FEATURE > 0)
static void USART_MspInit(UART_HandleTypeDef *huart);
static void USART_MspDeInit(UART_HandleTypeDef *huart);
#endif /* USE_BSP_COM_FEATURE */
/**
  * @}
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL_Exported_Variables Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTONn];
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
USART_TypeDef *COM_USART[COMn] =
#if defined (CORE_CA35) || defined (CORE_CM33)
{COM_CA35_UART, COM_CM33_UART, COM_CM0PLUS_UART};
#elif defined (CORE_CM0PLUS) /* Core_M0Plus uses only COM_CM0PLUS */
  {
    0, 0, COM_CM0PLUS_UART
  };
#endif /* CORE_<...> */

#endif /* USE_BSP_COM_FEATURE */
/**
  * @}
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL_Private_Variables Private Variables
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
static GPIO_TypeDef *LED_PORT[LEDn] = { LED1_GPIO_PORT,
                                        LED2_GPIO_PORT,
                                        LED3_GPIO_PORT,
                                        LED4_GPIO_PORT
                                      };

static const uint32_t LED_PIN[LEDn] = { LED1_PIN,
                                        LED2_PIN,
                                        LED3_PIN,
                                        LED4_PIN
                                      };

static const GPIO_PinState GPIO_LED_OFF[LEDn] = { GPIO_PIN_SET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET
                                                };

static const GPIO_PinState GPIO_LED_ON[LEDn] = { GPIO_PIN_RESET,
                                                 GPIO_PIN_SET,
                                                 GPIO_PIN_SET,
                                                 GPIO_PIN_SET
                                               };


static GPIO_TypeDef *BUTTON_PORT[BUTTONn] =
{
  BUTTON_WAKEUP_GPIO_PORT,
  BUTTON_USER1_GPIO_PORT,
  BUTTON_USER2_GPIO_PORT,
  BUTTON_TAMPER_GPIO_PORT
};
static const uint16_t BUTTON_PIN[BUTTONn] =
{
  BUTTON_WAKEUP_PIN,
  BUTTON_USER1_PIN,
  BUTTON_USER2_PIN,
  BUTTON_TAMPER_PIN
};
static const IRQn_Type BUTTON_IRQn[BUTTONn] =
{
  BUTTON_WAKEUP_EXTI_IRQn,
  BUTTON_USER1_EXTI_IRQn,
  BUTTON_USER2_EXTI_IRQn,
  BUTTON_TAMPER_EXTI_IRQn
};
#elif defined (CORE_CM0PLUS)
#warning "Core M0 can't manage LED in eval Board"
#endif /* CORE_CA35 || CORE_CM33*/

#if (USE_COM_LOG > 0)
/* define default active port to port dedicated to current Core
 * This is important for Validation applications which are not explicitly setting active log port */
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif /* USE_COM_LOG */
#if (USE_BSP_COM_FEATURE > 0)
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USE_BSP_COM_FEATURE */

/**
  * @}
  */

/** @defgroup STM32MP257F_EVAL_LOW_LEVEL_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32MP257CXX EVAL BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32MP257F_EV1_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardName(void)
{
  return (uint8_t *)STM32MP257F_EV1_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardID(void)
{
  return (uint8_t *)STM32MP257F_EV1_BSP_BOARD_ID;
}

#if defined (CORE_CA35) || defined (CORE_CM33)
/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*BSP LED Msp Init Configuration*/
  if (BSP_LED_MspInit(Led) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = LED_PIN[Led];
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

