STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval.c
  if (COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, USART_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, USART_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Register COM<n> Msp Callback registering
  * @param  COM COM port to be configured.
  * @param  Callbacks     pointer to COM MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_COM_RegisterMspCallbacks(COM_TypeDef COM, BSP_COM_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

  if (COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, Callback->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, Callback->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

#if (USE_COM_LOG > 0)
/**
  * @brief  Select the active COM port.
  * @param  COM COM port to be activated.
  *          This parameter can be COM1, COM2, COM3
  * @retval BSP status
  */
int32_t BSP_COM_SelectLogPort(COM_TypeDef COM)
{
  if (COM_ActiveLogPort != COM)
  {
    COM_ActiveLogPort = COM;
  }
  return BSP_ERROR_NONE;
}

#ifdef __GNUC__
int __io_putchar(int ch)
#else
int fputc(int ch, FILE *f)
#endif /* __GNUC__ */
{
  (void)HAL_UART_Transmit(&hcom_uart[COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}

#ifdef __GNUC__
int __io_getchar(void)
{
  uint8_t ch = 0;
  HAL_UART_Receive(&hcom_uart[COM_ActiveLogPort], (uint8_t *)&ch, 1, COM1_RX_TIMEOUT);
  return ch;
}
#endif /* __GNUC__ */
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE */

/** @defgroup STM32MP257F_EV1_LOW_LEVEL_Private_Functions Private Functions
  * @{
  */

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void USART_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pull = GPIO_PULLUP;

#if defined (CORE_CA35) || defined (CORE_CM33)

  if (huart->Instance == COM_CA35_UART)
  {
    /* USART2 clock config */
    ResMgr_Request(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_USART2_ID);

    /* Enable USART clock */
    COM_CA35_TX_GPIO_CLK_ENABLE();
    COM_CA35_RX_GPIO_CLK_ENABLE();
    COM_CA35_CLK_ENABLE();
    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CA35_TX_PIN;
    gpio_init_structure.Alternate = COM_CA35_TX_AF;
    HAL_GPIO_Init(COM_CA35_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CA35_RX_PIN;
    gpio_init_structure.Alternate = COM_CA35_RX_AF;
    HAL_GPIO_Init(COM_CA35_RX_GPIO_PORT, &gpio_init_structure);
  }
  else if (huart->Instance == COM_CM33_UART)
  {
    /* UART5 clock config */
    ResMgr_Request(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_UART5_ID);
    /* Enable UART clock */
    COM_CM33_CLK_ENABLE();

    if (!COM_CM33_TX_GPIO_IS_CLK_ENABLED())
    {
      if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(96)))
      {
        COM_CM33_TX_GPIO_CLK_ENABLE();
      }
    }
    if (!COM_CM33_RX_GPIO_IS_CLK_ENABLED())
    {
      if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(96)))
      {
        COM_CM33_RX_GPIO_CLK_ENABLE();
      }
    }

    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CM33_TX_PIN;
    gpio_init_structure.Alternate = COM_CM33_TX_AF;
    HAL_GPIO_Init(COM_CM33_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CM33_RX_PIN;
    gpio_init_structure.Alternate = COM_CM33_RX_AF;
    HAL_GPIO_Init(COM_CM33_RX_GPIO_PORT, &gpio_init_structure);
  }
  else if (huart->Instance == COM_CM0PLUS_UART)
  {
    /* LPUART clock config */
    ResMgr_Request(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_LPUART1_ID);

    /* Enable Backup domain access */
    HAL_PWR_EnableBkUpD3Access();

    /* Enable USART clock */
    COM_CM0PLUS_TX_GPIO_CLK_ENABLE();
    COM_CM0PLUS_RX_GPIO_CLK_ENABLE();
    COM_CM0PLUS_CLK_ENABLE();

    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CM0PLUS_TX_PIN;
    gpio_init_structure.Alternate = COM_CM0PLUS_TX_AF;
    HAL_GPIO_Init(COM_CM0PLUS_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CM0PLUS_RX_PIN;
    gpio_init_structure.Alternate = COM_CM0PLUS_RX_AF;
    HAL_GPIO_Init(COM_CM0PLUS_RX_GPIO_PORT, &gpio_init_structure);
  }

#elif defined(CORE_CM0PLUS)
  HAL_PWR_EnableBkUpAccess();
  /* Configure USART Tx as alternate function */
  gpio_init_structure.Pin = COM_CM0PLUS_TX_PIN;
  gpio_init_structure.Alternate = COM_CM0PLUS_TX_AF;
  HAL_GPIO_Init(COM_CM0PLUS_TX_GPIO_PORT, &gpio_init_structure);

  /* Configure USART Rx as alternate function */
  gpio_init_structure.Pin = COM_CM0PLUS_RX_PIN;
  gpio_init_structure.Alternate = COM_CM0PLUS_RX_AF;
  HAL_GPIO_Init(COM_CM0PLUS_RX_GPIO_PORT, &gpio_init_structure);
#warning "Core M0 can't manage RCC clock config"
#endif /* CORE_CA35 || CORE_CM33 */
}

/**
  * @brief  Initialize USART6 Msp part
  * @param  huart UART handle
  * @retval None
  */
static void USART_MspDeInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef          gpio_init_structure;

