STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval.c
#if defined (CORE_CA35) || defined (CORE_CM33)
  if (huart->Instance == COM_CA35_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CA35_TX_PIN;
    HAL_GPIO_DeInit(COM_CA35_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CA35_RX_PIN;
    HAL_GPIO_DeInit(COM_CA35_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CA35_CLK_DISABLE();
  }
  else if (huart->Instance == COM_CM33_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CM33_TX_PIN;
    HAL_GPIO_DeInit(COM_CM33_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CM33_RX_PIN;
    HAL_GPIO_DeInit(COM_CM33_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CM33_CLK_DISABLE();

    /* Release all hardware resources acquired using resource manager */
    (void)ResMgr_Release(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_UART5_ID);
    (void)ResMgr_Release(COM_CM33_RIF_RES_TYP_TX_PIN, COM_CM33_RIF_RES_NUM_TX_PIN);
    (void)ResMgr_Release(COM_CM33_RIF_RES_TYP_RX_PIN, COM_CM33_RIF_RES_NUM_RX_PIN);
  }
  else if (huart->Instance == COM_CM0PLUS_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CM0PLUS_TX_PIN;
    HAL_GPIO_DeInit(COM_CM0PLUS_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CM0PLUS_RX_PIN;
    HAL_GPIO_DeInit(COM_CM0PLUS_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CM0PLUS_CLK_DISABLE();
  }

#elif defined(CORE_CM0PLUS)
  /* COM GPIO pin configuration */
  gpio_init_structure.Pin  = COM_CM0PLUS_TX_PIN;
  HAL_GPIO_DeInit(COM_CM0PLUS_TX_GPIO_PORT, gpio_init_structure.Pin);

  gpio_init_structure.Pin  = COM_CM0PLUS_RX_PIN;
  HAL_GPIO_DeInit(COM_CM0PLUS_RX_GPIO_PORT, gpio_init_structure.Pin);
#warning "Core M0 can't manage RCC clock config"
#endif /* CORE_CA35 || CORE_CM33 */
}
#endif /* USE_BSP_COM_FEATURE */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
